perf/caso_base_redis.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm up
      duration: 60
      arrivalRate: 2
    - name: Ramp up
      duration: 30
      arrivalRate: 2
      rampTo: 10
    - name: Plain
      duration: 60
      arrivalRate: 10
    - name: Ramp down
      duration: 30
      arrivalRate: 10
      rampTo: 2
    - name: Cool down
      duration: 60
      arrivalRate: 2

scenarios:
  - name: Ping (/ping)
    weight: 1
    flow:
      - get:
          url: '/ping'

  - name: Metar with redis(/metar)
    weight: 1
    flow:
      - get:
          url: '/metar?station=SAEZ&redis=true'

  - name: Spaceflight News with Redis(/spaceflight_news)
    weight: 1
    flow:
      - get:
          url: '/spaceflight_news?redis=true'

  - name: Quote (/quote)
    weight: 1
    flow:
      - get:
          url: '/quote'